# RbsPipeConnectorSystemClassificationParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeConnectorSystemClassificationParam Property
ParameterTypeId Class See Also
---
"System Classification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeConnectorSystemClassificationParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeConnectorSystemClassificationParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeConnectorSystemClassificationParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace